Revit 2026 API

# TextNoteOptions Constructor

---

Default constructor; populates the options with their respective default values.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextNoteOptions()
```
```vb
Public Sub New
```
```cpp
public:
TextNoteOptions()
```
```fsharp
new : unit -> TextNoteOptions
```

The constructed options need to be given a typeId before it can be used to create a text note.

#### Reference

TextNoteOptions Class

TextNoteOptions Overload

Autodesk.Revit.DB Namespace